public class Task10 {
    public static void main(String[] args) {

        System.out.println(sum(2, 3));          // 5
        System.out.println(sum(4.5, 3.2));      // 7.7

    }

    static int sum(int x, int y) {

        return x + y;
    }

    static double sum(double x, double y) {

        return x + y;
    }


}



/*
Create a simple class with overloaded methods. Write another class to demonstrate the concept of methods overloading.

Создайте простой класс с перегруженными методами. Напишите еще один класс, чтобы продемонстрировать концепцию перегрузки методов.
 */