/*
public class Task8 {
}

https://ru.wikipedia.org/wiki/%D0%91%D0%BB%D0%BE%D0%BA_%D0%B8%D0%BD%D0%B8%D1%86%D0%B8%D0%B0%D0%BB%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D0%B8

Блок ініціалізації (initialization block) - поняття в об'єктно-орієнтованому програмуванні , в основному відоме з мови Java ,
яке є послідовністю команд, що виконуються при створенні ( завантаженні ) класів і об'єктів . Розроблено, щоб значно збільшити потужність конструктора .
Існують два типи: статичний блок ініціалізації, зазвичай званий для стислості статичний блок (static block), і динамічний блок ініціалізації (instance block).

Під час створення об'єкта виконуються різні команди, зазначені у конструкторі. Іноді виникає потреба розширення можливостей синтаксису.
Як правило, динамічний блок існує тільки для зручності - він може бути легко замінений шляхом додавання функції завантаження та виклику з кожного конструктора.
Проте статичний блок значною мірою збільшує функціональність програми і тому використовується набагато частіше.

Спочатку виконується статичний блок ініціалізації - він виконується, коли сам клас
ініціалізується та виконується лише один раз.

Після нього виконується нестатичний блок ініціалізації -
він виконується щоразу, коли створюються об’єкти класу.

А значення за замовчуванням змінним присвоюються під час їх оголошення.


 */


/*
Find the information about the order of initialization, when you create a new object of a class:
When constructors, initialization blocks are being executed.
When fields are initialized with default values.

Знайти інформацію про порядок ініціалізації, коли ви створюєте новий об'єкт класу:
Коли конструктори виконуються блоки ініціалізації.
Коли поля ініціалізуються значеннями за замовчуванням.
 */